{
  "timestamp": "2026-02-27T11:30:25.851409",
  "original_file": "output\\level3\\smolvla\\level_2_layer\\vlm_expert_transformer.py",
  "refactored_file": "output\\level3\\smolvla\\steps\\step_4_vlm_expert_transformer\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "PASS",
    "violations": [],
    "source_violations": [],
    "parameter_violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 290,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "vlm_layers.0.self_attn.q_proj.weight": "vlm_q_proj.0.weight",
      "vlm_layers.0.self_attn.k_proj.weight": "vlm_k_proj.0.weight",
      "vlm_layers.0.self_attn.v_proj.weight": "vlm_v_proj.0.weight",
      "vlm_layers.0.self_attn.o_proj.weight": "vlm_o_proj.0.weight",
      "vlm_layers.0.mlp.gate_proj.weight": "vlm_mlp.0.gate_proj.weight",
      "vlm_layers.0.mlp.up_proj.weight": "vlm_mlp.0.up_proj.weight",
      "vlm_layers.0.mlp.down_proj.weight": "vlm_mlp.0.down_proj.weight",
      "vlm_layers.0.input_layernorm.weight": "vlm_input_ln.0.weight",
      "vlm_layers.0.post_attention_layernorm.weight": "vlm_post_ln.0.weight",
      "vlm_layers.1.self_attn.q_proj.weight": "vlm_q_proj.1.weight",
      "vlm_layers.1.self_attn.k_proj.weight": "vlm_k_proj.1.weight",
      "vlm_layers.1.self_attn.v_proj.weight": "vlm_v_proj.1.weight",
      "vlm_layers.1.self_attn.o_proj.weight": "vlm_o_proj.1.weight",
      "vlm_layers.1.mlp.gate_proj.weight": "vlm_mlp.1.gate_proj.weight",
      "vlm_layers.1.mlp.up_proj.weight": "vlm_mlp.1.up_proj.weight",
      "vlm_layers.1.mlp.down_proj.weight": "vlm_mlp.1.down_proj.weight",
      "vlm_layers.1.input_layernorm.weight": "vlm_input_ln.1.weight",
      "vlm_layers.1.post_attention_layernorm.weight": "vlm_post_ln.1.weight",
      "vlm_layers.2.self_attn.q_proj.weight": "vlm_q_proj.2.weight",
      "vlm_layers.2.self_attn.k_proj.weight": "vlm_k_proj.2.weight",
      "vlm_layers.2.self_attn.v_proj.weight": "vlm_v_proj.2.weight",
      "vlm_layers.2.self_attn.o_proj.weight": "vlm_o_proj.2.weight",
      "vlm_layers.2.mlp.gate_proj.weight": "vlm_mlp.2.gate_proj.weight",
      "vlm_layers.2.mlp.up_proj.weight": "vlm_mlp.2.up_proj.weight",
      "vlm_layers.2.mlp.down_proj.weight": "vlm_mlp.2.down_proj.weight",
      "vlm_layers.2.input_layernorm.weight": "vlm_input_ln.2.weight",
      "vlm_layers.2.post_attention_layernorm.weight": "vlm_post_ln.2.weight",
      "vlm_layers.3.self_attn.q_proj.weight": "vlm_q_proj.3.weight",
      "vlm_layers.3.self_attn.k_proj.weight": "vlm_k_proj.3.weight",
      "vlm_layers.3.self_attn.v_proj.weight": "vlm_v_proj.3.weight",
      "vlm_layers.3.self_attn.o_proj.weight": "vlm_o_proj.3.weight",
      "vlm_layers.3.mlp.gate_proj.weight": "vlm_mlp.3.gate_proj.weight",
      "vlm_layers.3.mlp.up_proj.weight": "vlm_mlp.3.up_proj.weight",
      "vlm_layers.3.mlp.down_proj.weight": "vlm_mlp.3.down_proj.weight",
      "vlm_layers.3.input_layernorm.weight": "vlm_input_ln.3.weight",
      "vlm_layers.3.post_attention_layernorm.weight": "vlm_post_ln.3.weight",
      "vlm_layers.4.self_attn.q_proj.weight": "vlm_q_proj.4.weight",
      "vlm_layers.4.self_attn.k_proj.weight": "vlm_k_proj.4.weight",
      "vlm_layers.4.self_attn.v_proj.weight": "vlm_v_proj.4.weight",
      "vlm_layers.4.self_attn.o_proj.weight": "vlm_o_proj.4.weight",
      "vlm_layers.4.mlp.gate_proj.weight": "vlm_mlp.4.gate_proj.weight",
      "vlm_layers.4.mlp.up_proj.weight": "vlm_mlp.4.up_proj.weight",
      "vlm_layers.4.mlp.down_proj.weight": "vlm_mlp.4.down_proj.weight",
      "vlm_layers.4.input_layernorm.weight": "vlm_input_ln.4.weight",
      "vlm_layers.4.post_attention_layernorm.weight": "vlm_post_ln.4.weight",
      "vlm_layers.5.self_attn.q_proj.weight": "vlm_q_proj.5.weight",
      "vlm_layers.5.self_attn.k_proj.weight": "vlm_k_proj.5.weight",
      "vlm_layers.5.self_attn.v_proj.weight": "vlm_v_proj.5.weight",
      "vlm_layers.5.self_attn.o_proj.weight": "vlm_o_proj.5.weight",
      "vlm_layers.5.mlp.gate_proj.weight": "vlm_mlp.5.gate_proj.weight",
      "vlm_layers.5.mlp.up_proj.weight": "vlm_mlp.5.up_proj.weight",
      "vlm_layers.5.mlp.down_proj.weight": "vlm_mlp.5.down_proj.weight",
      "vlm_layers.5.input_layernorm.weight": "vlm_input_ln.5.weight",
      "vlm_layers.5.post_attention_layernorm.weight": "vlm_post_ln.5.weight",
      "vlm_layers.6.self_attn.q_proj.weight": "vlm_q_proj.6.weight",
      "vlm_layers.6.self_attn.k_proj.weight": "vlm_k_proj.6.weight",
      "vlm_layers.6.self_attn.v_proj.weight": "vlm_v_proj.6.weight",
      "vlm_layers.6.self_attn.o_proj.weight": "vlm_o_proj.6.weight",
      "vlm_layers.6.mlp.gate_proj.weight": "vlm_mlp.6.gate_proj.weight",
      "vlm_layers.6.mlp.up_proj.weight": "vlm_mlp.6.up_proj.weight",
      "vlm_layers.6.mlp.down_proj.weight": "vlm_mlp.6.down_proj.weight",
      "vlm_layers.6.input_layernorm.weight": "vlm_input_ln.6.weight",
      "vlm_layers.6.post_attention_layernorm.weight": "vlm_post_ln.6.weight",
      "vlm_layers.7.self_attn.q_proj.weight": "vlm_q_proj.7.weight",
      "vlm_layers.7.self_attn.k_proj.weight": "vlm_k_proj.7.weight",
      "vlm_layers.7.self_attn.v_proj.weight": "vlm_v_proj.7.weight",
      "vlm_layers.7.self_attn.o_proj.weight": "vlm_o_proj.7.weight",
      "vlm_layers.7.mlp.gate_proj.weight": "vlm_mlp.7.gate_proj.weight",
      "vlm_layers.7.mlp.up_proj.weight": "vlm_mlp.7.up_proj.weight",
      "vlm_layers.7.mlp.down_proj.weight": "vlm_mlp.7.down_proj.weight",
      "vlm_layers.7.input_layernorm.weight": "vlm_input_ln.7.weight",
      "vlm_layers.7.post_attention_layernorm.weight": "vlm_post_ln.7.weight",
      "vlm_layers.8.self_attn.q_proj.weight": "vlm_q_proj.8.weight",
      "vlm_layers.8.self_attn.k_proj.weight": "vlm_k_proj.8.weight",
      "vlm_layers.8.self_attn.v_proj.weight": "vlm_v_proj.8.weight",
      "vlm_layers.8.self_attn.o_proj.weight": "vlm_o_proj.8.weight",
      "vlm_layers.8.mlp.gate_proj.weight": "vlm_mlp.8.gate_proj.weight",
      "vlm_layers.8.mlp.up_proj.weight": "vlm_mlp.8.up_proj.weight",
      "vlm_layers.8.mlp.down_proj.weight": "vlm_mlp.8.down_proj.weight",
      "vlm_layers.8.input_layernorm.weight": "vlm_input_ln.8.weight",
      "vlm_layers.8.post_attention_layernorm.weight": "vlm_post_ln.8.weight",
      "vlm_layers.9.self_attn.q_proj.weight": "vlm_q_proj.9.weight",
      "vlm_layers.9.self_attn.k_proj.weight": "vlm_k_proj.9.weight",
      "vlm_layers.9.self_attn.v_proj.weight": "vlm_v_proj.9.weight",
      "vlm_layers.9.self_attn.o_proj.weight": "vlm_o_proj.9.weight",
      "vlm_layers.9.mlp.gate_proj.weight": "vlm_mlp.9.gate_proj.weight",
      "vlm_layers.9.mlp.up_proj.weight": "vlm_mlp.9.up_proj.weight",
      "vlm_layers.9.mlp.down_proj.weight": "vlm_mlp.9.down_proj.weight",
      "vlm_layers.9.input_layernorm.weight": "vlm_input_ln.9.weight",
      "vlm_layers.9.post_attention_layernorm.weight": "vlm_post_ln.9.weight",
      "vlm_layers.10.self_attn.q_proj.weight": "vlm_q_proj.10.weight",
      "vlm_layers.10.self_attn.k_proj.weight": "vlm_k_proj.10.weight",
      "vlm_layers.10.self_attn.v_proj.weight": "vlm_v_proj.10.weight",
      "vlm_layers.10.self_attn.o_proj.weight": "vlm_o_proj.10.weight",
      "vlm_layers.10.mlp.gate_proj.weight": "vlm_mlp.10.gate_proj.weight",
      "vlm_layers.10.mlp.up_proj.weight": "vlm_mlp.10.up_proj.weight",
      "vlm_layers.10.mlp.down_proj.weight": "vlm_mlp.10.down_proj.weight",
      "vlm_layers.10.input_layernorm.weight": "vlm_input_ln.10.weight",
      "vlm_layers.10.post_attention_layernorm.weight": "vlm_post_ln.10.weight",
      "vlm_layers.11.self_attn.q_proj.weight": "vlm_q_proj.11.weight",
      "vlm_layers.11.self_attn.k_proj.weight": "vlm_k_proj.11.weight",
      "vlm_layers.11.self_attn.v_proj.weight": "vlm_v_proj.11.weight",
      "vlm_layers.11.self_attn.o_proj.weight": "vlm_o_proj.11.weight",
      "vlm_layers.11.mlp.gate_proj.weight": "vlm_mlp.11.gate_proj.weight",
      "vlm_layers.11.mlp.up_proj.weight": "vlm_mlp.11.up_proj.weight",
      "vlm_layers.11.mlp.down_proj.weight": "vlm_mlp.11.down_proj.weight",
      "vlm_layers.11.input_layernorm.weight": "vlm_input_ln.11.weight",
      "vlm_layers.11.post_attention_layernorm.weight": "vlm_post_ln.11.weight",
      "vlm_layers.12.self_attn.q_proj.weight": "vlm_q_proj.12.weight",
      "vlm_layers.12.self_attn.k_proj.weight": "vlm_k_proj.12.weight",
      "vlm_layers.12.self_attn.v_proj.weight": "vlm_v_proj.12.weight",
      "vlm_layers.12.self_attn.o_proj.weight": "vlm_o_proj.12.weight",
      "vlm_layers.12.mlp.gate_proj.weight": "vlm_mlp.12.gate_proj.weight",
      "vlm_layers.12.mlp.up_proj.weight": "vlm_mlp.12.up_proj.weight",
      "vlm_layers.12.mlp.down_proj.weight": "vlm_mlp.12.down_proj.weight",
      "vlm_layers.12.input_layernorm.weight": "vlm_input_ln.12.weight",
      "vlm_layers.12.post_attention_layernorm.weight": "vlm_post_ln.12.weight",
      "vlm_layers.13.self_attn.q_proj.weight": "vlm_q_proj.13.weight",
      "vlm_layers.13.self_attn.k_proj.weight": "vlm_k_proj.13.weight",
      "vlm_layers.13.self_attn.v_proj.weight": "vlm_v_proj.13.weight",
      "vlm_layers.13.self_attn.o_proj.weight": "vlm_o_proj.13.weight",
      "vlm_layers.13.mlp.gate_proj.weight": "vlm_mlp.13.gate_proj.weight",
      "vlm_layers.13.mlp.up_proj.weight": "vlm_mlp.13.up_proj.weight",
      "vlm_layers.13.mlp.down_proj.weight": "vlm_mlp.13.down_proj.weight",
      "vlm_layers.13.input_layernorm.weight": "vlm_input_ln.13.weight",
      "vlm_layers.13.post_attention_layernorm.weight": "vlm_post_ln.13.weight",
      "vlm_layers.14.self_attn.q_proj.weight": "vlm_q_proj.14.weight",
      "vlm_layers.14.self_attn.k_proj.weight": "vlm_k_proj.14.weight",
      "vlm_layers.14.self_attn.v_proj.weight": "vlm_v_proj.14.weight",
      "vlm_layers.14.self_attn.o_proj.weight": "vlm_o_proj.14.weight",
      "vlm_layers.14.mlp.gate_proj.weight": "vlm_mlp.14.gate_proj.weight",
      "vlm_layers.14.mlp.up_proj.weight": "vlm_mlp.14.up_proj.weight",
      "vlm_layers.14.mlp.down_proj.weight": "vlm_mlp.14.down_proj.weight",
      "vlm_layers.14.input_layernorm.weight": "vlm_input_ln.14.weight",
      "vlm_layers.14.post_attention_layernorm.weight": "vlm_post_ln.14.weight",
      "vlm_layers.15.self_attn.q_proj.weight": "vlm_q_proj.15.weight",
      "vlm_layers.15.self_attn.k_proj.weight": "vlm_k_proj.15.weight",
      "vlm_layers.15.self_attn.v_proj.weight": "vlm_v_proj.15.weight",
      "vlm_layers.15.self_attn.o_proj.weight": "vlm_o_proj.15.weight",
      "vlm_layers.15.mlp.gate_proj.weight": "vlm_mlp.15.gate_proj.weight",
      "vlm_layers.15.mlp.up_proj.weight": "vlm_mlp.15.up_proj.weight",
      "vlm_layers.15.mlp.down_proj.weight": "vlm_mlp.15.down_proj.weight",
      "vlm_layers.15.input_layernorm.weight": "vlm_input_ln.15.weight",
      "vlm_layers.15.post_attention_layernorm.weight": "vlm_post_ln.15.weight",
      "vlm_norm.weight": "vlm_norm.weight",
      "expert_layers.0.self_attn.q_proj.weight": "exp_q_proj.0.weight",
      "expert_layers.0.self_attn.k_proj.weight": "exp_k_proj.0.weight",
      "expert_layers.0.self_attn.v_proj.weight": "exp_v_proj.0.weight",
      "expert_layers.0.self_attn.o_proj.weight": "exp_o_proj.0.weight",
      "expert_layers.0.mlp.gate_proj.weight": "exp_mlp.0.gate_proj.weight",
      "expert_layers.0.mlp.up_proj.weight": "exp_mlp.0.up_proj.weight",
      "expert_layers.0.mlp.down_proj.weight": "exp_mlp.0.down_proj.weight",
      "expert_layers.0.input_layernorm.weight": "exp_input_ln.0.weight",
      "expert_layers.0.post_attention_layernorm.weight": "exp_post_ln.0.weight",
      "expert_layers.1.self_attn.q_proj.weight": "exp_q_proj.1.weight",
      "expert_layers.1.self_attn.k_proj.weight": "exp_k_proj.1.weight",
      "expert_layers.1.self_attn.v_proj.weight": "exp_v_proj.1.weight",
      "expert_layers.1.self_attn.o_proj.weight": "exp_o_proj.1.weight",
      "expert_layers.1.mlp.gate_proj.weight": "exp_mlp.1.gate_proj.weight",
      "expert_layers.1.mlp.up_proj.weight": "exp_mlp.1.up_proj.weight",
      "expert_layers.1.mlp.down_proj.weight": "exp_mlp.1.down_proj.weight",
      "expert_layers.1.input_layernorm.weight": "exp_input_ln.1.weight",
      "expert_layers.1.post_attention_layernorm.weight": "exp_post_ln.1.weight",
      "expert_layers.2.self_attn.q_proj.weight": "exp_q_proj.2.weight",
      "expert_layers.2.self_attn.k_proj.weight": "exp_k_proj.2.weight",
      "expert_layers.2.self_attn.v_proj.weight": "exp_v_proj.2.weight",
      "expert_layers.2.self_attn.o_proj.weight": "exp_o_proj.2.weight",
      "expert_layers.2.mlp.gate_proj.weight": "exp_mlp.2.gate_proj.weight",
      "expert_layers.2.mlp.up_proj.weight": "exp_mlp.2.up_proj.weight",
      "expert_layers.2.mlp.down_proj.weight": "exp_mlp.2.down_proj.weight",
      "expert_layers.2.input_layernorm.weight": "exp_input_ln.2.weight",
      "expert_layers.2.post_attention_layernorm.weight": "exp_post_ln.2.weight",
      "expert_layers.3.self_attn.q_proj.weight": "exp_q_proj.3.weight",
      "expert_layers.3.self_attn.k_proj.weight": "exp_k_proj.3.weight",
      "expert_layers.3.self_attn.v_proj.weight": "exp_v_proj.3.weight",
      "expert_layers.3.self_attn.o_proj.weight": "exp_o_proj.3.weight",
      "expert_layers.3.mlp.gate_proj.weight": "exp_mlp.3.gate_proj.weight",
      "expert_layers.3.mlp.up_proj.weight": "exp_mlp.3.up_proj.weight",
      "expert_layers.3.mlp.down_proj.weight": "exp_mlp.3.down_proj.weight",
      "expert_layers.3.input_layernorm.weight": "exp_input_ln.3.weight",
      "expert_layers.3.post_attention_layernorm.weight": "exp_post_ln.3.weight",
      "expert_layers.4.self_attn.q_proj.weight": "exp_q_proj.4.weight",
      "expert_layers.4.self_attn.k_proj.weight": "exp_k_proj.4.weight",
      "expert_layers.4.self_attn.v_proj.weight": "exp_v_proj.4.weight",
      "expert_layers.4.self_attn.o_proj.weight": "exp_o_proj.4.weight",
      "expert_layers.4.mlp.gate_proj.weight": "exp_mlp.4.gate_proj.weight",
      "expert_layers.4.mlp.up_proj.weight": "exp_mlp.4.up_proj.weight",
      "expert_layers.4.mlp.down_proj.weight": "exp_mlp.4.down_proj.weight",
      "expert_layers.4.input_layernorm.weight": "exp_input_ln.4.weight",
      "expert_layers.4.post_attention_layernorm.weight": "exp_post_ln.4.weight",
      "expert_layers.5.self_attn.q_proj.weight": "exp_q_proj.5.weight",
      "expert_layers.5.self_attn.k_proj.weight": "exp_k_proj.5.weight",
      "expert_layers.5.self_attn.v_proj.weight": "exp_v_proj.5.weight",
      "expert_layers.5.self_attn.o_proj.weight": "exp_o_proj.5.weight",
      "expert_layers.5.mlp.gate_proj.weight": "exp_mlp.5.gate_proj.weight",
      "expert_layers.5.mlp.up_proj.weight": "exp_mlp.5.up_proj.weight",
      "expert_layers.5.mlp.down_proj.weight": "exp_mlp.5.down_proj.weight",
      "expert_layers.5.input_layernorm.weight": "exp_input_ln.5.weight",
      "expert_layers.5.post_attention_layernorm.weight": "exp_post_ln.5.weight",
      "expert_layers.6.self_attn.q_proj.weight": "exp_q_proj.6.weight",
      "expert_layers.6.self_attn.k_proj.weight": "exp_k_proj.6.weight",
      "expert_layers.6.self_attn.v_proj.weight": "exp_v_proj.6.weight",
      "expert_layers.6.self_attn.o_proj.weight": "exp_o_proj.6.weight",
      "expert_layers.6.mlp.gate_proj.weight": "exp_mlp.6.gate_proj.weight",
      "expert_layers.6.mlp.up_proj.weight": "exp_mlp.6.up_proj.weight",
      "expert_layers.6.mlp.down_proj.weight": "exp_mlp.6.down_proj.weight",
      "expert_layers.6.input_layernorm.weight": "exp_input_ln.6.weight",
      "expert_layers.6.post_attention_layernorm.weight": "exp_post_ln.6.weight",
      "expert_layers.7.self_attn.q_proj.weight": "exp_q_proj.7.weight",
      "expert_layers.7.self_attn.k_proj.weight": "exp_k_proj.7.weight",
      "expert_layers.7.self_attn.v_proj.weight": "exp_v_proj.7.weight",
      "expert_layers.7.self_attn.o_proj.weight": "exp_o_proj.7.weight",
      "expert_layers.7.mlp.gate_proj.weight": "exp_mlp.7.gate_proj.weight",
      "expert_layers.7.mlp.up_proj.weight": "exp_mlp.7.up_proj.weight",
      "expert_layers.7.mlp.down_proj.weight": "exp_mlp.7.down_proj.weight",
      "expert_layers.7.input_layernorm.weight": "exp_input_ln.7.weight",
      "expert_layers.7.post_attention_layernorm.weight": "exp_post_ln.7.weight",
      "expert_layers.8.self_attn.q_proj.weight": "exp_q_proj.8.weight",
      "expert_layers.8.self_attn.k_proj.weight": "exp_k_proj.8.weight",
      "expert_layers.8.self_attn.v_proj.weight": "exp_v_proj.8.weight",
      "expert_layers.8.self_attn.o_proj.weight": "exp_o_proj.8.weight",
      "expert_layers.8.mlp.gate_proj.weight": "exp_mlp.8.gate_proj.weight",
      "expert_layers.8.mlp.up_proj.weight": "exp_mlp.8.up_proj.weight",
      "expert_layers.8.mlp.down_proj.weight": "exp_mlp.8.down_proj.weight",
      "expert_layers.8.input_layernorm.weight": "exp_input_ln.8.weight",
      "expert_layers.8.post_attention_layernorm.weight": "exp_post_ln.8.weight",
      "expert_layers.9.self_attn.q_proj.weight": "exp_q_proj.9.weight",
      "expert_layers.9.self_attn.k_proj.weight": "exp_k_proj.9.weight",
      "expert_layers.9.self_attn.v_proj.weight": "exp_v_proj.9.weight",
      "expert_layers.9.self_attn.o_proj.weight": "exp_o_proj.9.weight",
      "expert_layers.9.mlp.gate_proj.weight": "exp_mlp.9.gate_proj.weight",
      "expert_layers.9.mlp.up_proj.weight": "exp_mlp.9.up_proj.weight",
      "expert_layers.9.mlp.down_proj.weight": "exp_mlp.9.down_proj.weight",
      "expert_layers.9.input_layernorm.weight": "exp_input_ln.9.weight",
      "expert_layers.9.post_attention_layernorm.weight": "exp_post_ln.9.weight",
      "expert_layers.10.self_attn.q_proj.weight": "exp_q_proj.10.weight",
      "expert_layers.10.self_attn.k_proj.weight": "exp_k_proj.10.weight",
      "expert_layers.10.self_attn.v_proj.weight": "exp_v_proj.10.weight",
      "expert_layers.10.self_attn.o_proj.weight": "exp_o_proj.10.weight",
      "expert_layers.10.mlp.gate_proj.weight": "exp_mlp.10.gate_proj.weight",
      "expert_layers.10.mlp.up_proj.weight": "exp_mlp.10.up_proj.weight",
      "expert_layers.10.mlp.down_proj.weight": "exp_mlp.10.down_proj.weight",
      "expert_layers.10.input_layernorm.weight": "exp_input_ln.10.weight",
      "expert_layers.10.post_attention_layernorm.weight": "exp_post_ln.10.weight",
      "expert_layers.11.self_attn.q_proj.weight": "exp_q_proj.11.weight",
      "expert_layers.11.self_attn.k_proj.weight": "exp_k_proj.11.weight",
      "expert_layers.11.self_attn.v_proj.weight": "exp_v_proj.11.weight",
      "expert_layers.11.self_attn.o_proj.weight": "exp_o_proj.11.weight",
      "expert_layers.11.mlp.gate_proj.weight": "exp_mlp.11.gate_proj.weight",
      "expert_layers.11.mlp.up_proj.weight": "exp_mlp.11.up_proj.weight",
      "expert_layers.11.mlp.down_proj.weight": "exp_mlp.11.down_proj.weight",
      "expert_layers.11.input_layernorm.weight": "exp_input_ln.11.weight",
      "expert_layers.11.post_attention_layernorm.weight": "exp_post_ln.11.weight",
      "expert_layers.12.self_attn.q_proj.weight": "exp_q_proj.12.weight",
      "expert_layers.12.self_attn.k_proj.weight": "exp_k_proj.12.weight",
      "expert_layers.12.self_attn.v_proj.weight": "exp_v_proj.12.weight",
      "expert_layers.12.self_attn.o_proj.weight": "exp_o_proj.12.weight",
      "expert_layers.12.mlp.gate_proj.weight": "exp_mlp.12.gate_proj.weight",
      "expert_layers.12.mlp.up_proj.weight": "exp_mlp.12.up_proj.weight",
      "expert_layers.12.mlp.down_proj.weight": "exp_mlp.12.down_proj.weight",
      "expert_layers.12.input_layernorm.weight": "exp_input_ln.12.weight",
      "expert_layers.12.post_attention_layernorm.weight": "exp_post_ln.12.weight",
      "expert_layers.13.self_attn.q_proj.weight": "exp_q_proj.13.weight",
      "expert_layers.13.self_attn.k_proj.weight": "exp_k_proj.13.weight",
      "expert_layers.13.self_attn.v_proj.weight": "exp_v_proj.13.weight",
      "expert_layers.13.self_attn.o_proj.weight": "exp_o_proj.13.weight",
      "expert_layers.13.mlp.gate_proj.weight": "exp_mlp.13.gate_proj.weight",
      "expert_layers.13.mlp.up_proj.weight": "exp_mlp.13.up_proj.weight",
      "expert_layers.13.mlp.down_proj.weight": "exp_mlp.13.down_proj.weight",
      "expert_layers.13.input_layernorm.weight": "exp_input_ln.13.weight",
      "expert_layers.13.post_attention_layernorm.weight": "exp_post_ln.13.weight",
      "expert_layers.14.self_attn.q_proj.weight": "exp_q_proj.14.weight",
      "expert_layers.14.self_attn.k_proj.weight": "exp_k_proj.14.weight",
      "expert_layers.14.self_attn.v_proj.weight": "exp_v_proj.14.weight",
      "expert_layers.14.self_attn.o_proj.weight": "exp_o_proj.14.weight",
      "expert_layers.14.mlp.gate_proj.weight": "exp_mlp.14.gate_proj.weight",
      "expert_layers.14.mlp.up_proj.weight": "exp_mlp.14.up_proj.weight",
      "expert_layers.14.mlp.down_proj.weight": "exp_mlp.14.down_proj.weight",
      "expert_layers.14.input_layernorm.weight": "exp_input_ln.14.weight",
      "expert_layers.14.post_attention_layernorm.weight": "exp_post_ln.14.weight",
      "expert_layers.15.self_attn.q_proj.weight": "exp_q_proj.15.weight",
      "expert_layers.15.self_attn.k_proj.weight": "exp_k_proj.15.weight",
      "expert_layers.15.self_attn.v_proj.weight": "exp_v_proj.15.weight",
      "expert_layers.15.self_attn.o_proj.weight": "exp_o_proj.15.weight",
      "expert_layers.15.mlp.gate_proj.weight": "exp_mlp.15.gate_proj.weight",
      "expert_layers.15.mlp.up_proj.weight": "exp_mlp.15.up_proj.weight",
      "expert_layers.15.mlp.down_proj.weight": "exp_mlp.15.down_proj.weight",
      "expert_layers.15.input_layernorm.weight": "exp_input_ln.15.weight",
      "expert_layers.15.post_attention_layernorm.weight": "exp_post_ln.15.weight",
      "expert_norm.weight": "exp_norm.weight"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              50,
              720
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              50,
              720
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              50,
              720
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}