{
  "timestamp": "2026-02-27T11:17:23.289606",
  "original_file": "output\\level3\\smolvla\\level_3_model\\smolvla.py",
  "refactored_file": "output\\level3\\smolvla\\steps\\step_1_model_to_layers\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "PASS",
    "violations": [],
    "source_violations": [],
    "parameter_violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 499,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "vlm_with_expert.vision_encoder.embeddings.patch_embedding.weight": "vision_encoder.embeddings.patch_embedding.weight",
      "vlm_with_expert.vision_encoder.embeddings.patch_embedding.bias": "vision_encoder.embeddings.patch_embedding.bias",
      "vlm_with_expert.vision_encoder.embeddings.position_embedding.weight": "vision_encoder.embeddings.position_embedding.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.0.self_attn.q_proj.weight": "vision_encoder.encoder.layers.0.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.0.self_attn.q_proj.bias": "vision_encoder.encoder.layers.0.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.0.self_attn.k_proj.weight": "vision_encoder.encoder.layers.0.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.0.self_attn.k_proj.bias": "vision_encoder.encoder.layers.0.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.0.self_attn.v_proj.weight": "vision_encoder.encoder.layers.0.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.0.self_attn.v_proj.bias": "vision_encoder.encoder.layers.0.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.0.self_attn.out_proj.weight": "vision_encoder.encoder.layers.0.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.0.self_attn.out_proj.bias": "vision_encoder.encoder.layers.0.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.0.layer_norm1.weight": "vision_encoder.encoder.layers.0.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.0.layer_norm1.bias": "vision_encoder.encoder.layers.0.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.0.mlp.fc1.weight": "vision_encoder.encoder.layers.0.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.0.mlp.fc1.bias": "vision_encoder.encoder.layers.0.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.0.mlp.fc2.weight": "vision_encoder.encoder.layers.0.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.0.mlp.fc2.bias": "vision_encoder.encoder.layers.0.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.0.layer_norm2.weight": "vision_encoder.encoder.layers.0.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.0.layer_norm2.bias": "vision_encoder.encoder.layers.0.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.1.self_attn.q_proj.weight": "vision_encoder.encoder.layers.1.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.1.self_attn.q_proj.bias": "vision_encoder.encoder.layers.1.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.1.self_attn.k_proj.weight": "vision_encoder.encoder.layers.1.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.1.self_attn.k_proj.bias": "vision_encoder.encoder.layers.1.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.1.self_attn.v_proj.weight": "vision_encoder.encoder.layers.1.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.1.self_attn.v_proj.bias": "vision_encoder.encoder.layers.1.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.1.self_attn.out_proj.weight": "vision_encoder.encoder.layers.1.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.1.self_attn.out_proj.bias": "vision_encoder.encoder.layers.1.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.1.layer_norm1.weight": "vision_encoder.encoder.layers.1.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.1.layer_norm1.bias": "vision_encoder.encoder.layers.1.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.1.mlp.fc1.weight": "vision_encoder.encoder.layers.1.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.1.mlp.fc1.bias": "vision_encoder.encoder.layers.1.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.1.mlp.fc2.weight": "vision_encoder.encoder.layers.1.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.1.mlp.fc2.bias": "vision_encoder.encoder.layers.1.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.1.layer_norm2.weight": "vision_encoder.encoder.layers.1.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.1.layer_norm2.bias": "vision_encoder.encoder.layers.1.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.2.self_attn.q_proj.weight": "vision_encoder.encoder.layers.2.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.2.self_attn.q_proj.bias": "vision_encoder.encoder.layers.2.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.2.self_attn.k_proj.weight": "vision_encoder.encoder.layers.2.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.2.self_attn.k_proj.bias": "vision_encoder.encoder.layers.2.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.2.self_attn.v_proj.weight": "vision_encoder.encoder.layers.2.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.2.self_attn.v_proj.bias": "vision_encoder.encoder.layers.2.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.2.self_attn.out_proj.weight": "vision_encoder.encoder.layers.2.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.2.self_attn.out_proj.bias": "vision_encoder.encoder.layers.2.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.2.layer_norm1.weight": "vision_encoder.encoder.layers.2.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.2.layer_norm1.bias": "vision_encoder.encoder.layers.2.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.2.mlp.fc1.weight": "vision_encoder.encoder.layers.2.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.2.mlp.fc1.bias": "vision_encoder.encoder.layers.2.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.2.mlp.fc2.weight": "vision_encoder.encoder.layers.2.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.2.mlp.fc2.bias": "vision_encoder.encoder.layers.2.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.2.layer_norm2.weight": "vision_encoder.encoder.layers.2.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.2.layer_norm2.bias": "vision_encoder.encoder.layers.2.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.3.self_attn.q_proj.weight": "vision_encoder.encoder.layers.3.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.3.self_attn.q_proj.bias": "vision_encoder.encoder.layers.3.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.3.self_attn.k_proj.weight": "vision_encoder.encoder.layers.3.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.3.self_attn.k_proj.bias": "vision_encoder.encoder.layers.3.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.3.self_attn.v_proj.weight": "vision_encoder.encoder.layers.3.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.3.self_attn.v_proj.bias": "vision_encoder.encoder.layers.3.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.3.self_attn.out_proj.weight": "vision_encoder.encoder.layers.3.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.3.self_attn.out_proj.bias": "vision_encoder.encoder.layers.3.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.3.layer_norm1.weight": "vision_encoder.encoder.layers.3.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.3.layer_norm1.bias": "vision_encoder.encoder.layers.3.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.3.mlp.fc1.weight": "vision_encoder.encoder.layers.3.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.3.mlp.fc1.bias": "vision_encoder.encoder.layers.3.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.3.mlp.fc2.weight": "vision_encoder.encoder.layers.3.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.3.mlp.fc2.bias": "vision_encoder.encoder.layers.3.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.3.layer_norm2.weight": "vision_encoder.encoder.layers.3.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.3.layer_norm2.bias": "vision_encoder.encoder.layers.3.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.4.self_attn.q_proj.weight": "vision_encoder.encoder.layers.4.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.4.self_attn.q_proj.bias": "vision_encoder.encoder.layers.4.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.4.self_attn.k_proj.weight": "vision_encoder.encoder.layers.4.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.4.self_attn.k_proj.bias": "vision_encoder.encoder.layers.4.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.4.self_attn.v_proj.weight": "vision_encoder.encoder.layers.4.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.4.self_attn.v_proj.bias": "vision_encoder.encoder.layers.4.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.4.self_attn.out_proj.weight": "vision_encoder.encoder.layers.4.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.4.self_attn.out_proj.bias": "vision_encoder.encoder.layers.4.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.4.layer_norm1.weight": "vision_encoder.encoder.layers.4.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.4.layer_norm1.bias": "vision_encoder.encoder.layers.4.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.4.mlp.fc1.weight": "vision_encoder.encoder.layers.4.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.4.mlp.fc1.bias": "vision_encoder.encoder.layers.4.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.4.mlp.fc2.weight": "vision_encoder.encoder.layers.4.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.4.mlp.fc2.bias": "vision_encoder.encoder.layers.4.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.4.layer_norm2.weight": "vision_encoder.encoder.layers.4.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.4.layer_norm2.bias": "vision_encoder.encoder.layers.4.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.5.self_attn.q_proj.weight": "vision_encoder.encoder.layers.5.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.5.self_attn.q_proj.bias": "vision_encoder.encoder.layers.5.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.5.self_attn.k_proj.weight": "vision_encoder.encoder.layers.5.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.5.self_attn.k_proj.bias": "vision_encoder.encoder.layers.5.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.5.self_attn.v_proj.weight": "vision_encoder.encoder.layers.5.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.5.self_attn.v_proj.bias": "vision_encoder.encoder.layers.5.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.5.self_attn.out_proj.weight": "vision_encoder.encoder.layers.5.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.5.self_attn.out_proj.bias": "vision_encoder.encoder.layers.5.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.5.layer_norm1.weight": "vision_encoder.encoder.layers.5.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.5.layer_norm1.bias": "vision_encoder.encoder.layers.5.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.5.mlp.fc1.weight": "vision_encoder.encoder.layers.5.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.5.mlp.fc1.bias": "vision_encoder.encoder.layers.5.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.5.mlp.fc2.weight": "vision_encoder.encoder.layers.5.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.5.mlp.fc2.bias": "vision_encoder.encoder.layers.5.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.5.layer_norm2.weight": "vision_encoder.encoder.layers.5.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.5.layer_norm2.bias": "vision_encoder.encoder.layers.5.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.6.self_attn.q_proj.weight": "vision_encoder.encoder.layers.6.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.6.self_attn.q_proj.bias": "vision_encoder.encoder.layers.6.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.6.self_attn.k_proj.weight": "vision_encoder.encoder.layers.6.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.6.self_attn.k_proj.bias": "vision_encoder.encoder.layers.6.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.6.self_attn.v_proj.weight": "vision_encoder.encoder.layers.6.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.6.self_attn.v_proj.bias": "vision_encoder.encoder.layers.6.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.6.self_attn.out_proj.weight": "vision_encoder.encoder.layers.6.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.6.self_attn.out_proj.bias": "vision_encoder.encoder.layers.6.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.6.layer_norm1.weight": "vision_encoder.encoder.layers.6.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.6.layer_norm1.bias": "vision_encoder.encoder.layers.6.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.6.mlp.fc1.weight": "vision_encoder.encoder.layers.6.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.6.mlp.fc1.bias": "vision_encoder.encoder.layers.6.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.6.mlp.fc2.weight": "vision_encoder.encoder.layers.6.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.6.mlp.fc2.bias": "vision_encoder.encoder.layers.6.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.6.layer_norm2.weight": "vision_encoder.encoder.layers.6.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.6.layer_norm2.bias": "vision_encoder.encoder.layers.6.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.7.self_attn.q_proj.weight": "vision_encoder.encoder.layers.7.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.7.self_attn.q_proj.bias": "vision_encoder.encoder.layers.7.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.7.self_attn.k_proj.weight": "vision_encoder.encoder.layers.7.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.7.self_attn.k_proj.bias": "vision_encoder.encoder.layers.7.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.7.self_attn.v_proj.weight": "vision_encoder.encoder.layers.7.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.7.self_attn.v_proj.bias": "vision_encoder.encoder.layers.7.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.7.self_attn.out_proj.weight": "vision_encoder.encoder.layers.7.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.7.self_attn.out_proj.bias": "vision_encoder.encoder.layers.7.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.7.layer_norm1.weight": "vision_encoder.encoder.layers.7.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.7.layer_norm1.bias": "vision_encoder.encoder.layers.7.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.7.mlp.fc1.weight": "vision_encoder.encoder.layers.7.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.7.mlp.fc1.bias": "vision_encoder.encoder.layers.7.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.7.mlp.fc2.weight": "vision_encoder.encoder.layers.7.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.7.mlp.fc2.bias": "vision_encoder.encoder.layers.7.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.7.layer_norm2.weight": "vision_encoder.encoder.layers.7.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.7.layer_norm2.bias": "vision_encoder.encoder.layers.7.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.8.self_attn.q_proj.weight": "vision_encoder.encoder.layers.8.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.8.self_attn.q_proj.bias": "vision_encoder.encoder.layers.8.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.8.self_attn.k_proj.weight": "vision_encoder.encoder.layers.8.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.8.self_attn.k_proj.bias": "vision_encoder.encoder.layers.8.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.8.self_attn.v_proj.weight": "vision_encoder.encoder.layers.8.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.8.self_attn.v_proj.bias": "vision_encoder.encoder.layers.8.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.8.self_attn.out_proj.weight": "vision_encoder.encoder.layers.8.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.8.self_attn.out_proj.bias": "vision_encoder.encoder.layers.8.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.8.layer_norm1.weight": "vision_encoder.encoder.layers.8.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.8.layer_norm1.bias": "vision_encoder.encoder.layers.8.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.8.mlp.fc1.weight": "vision_encoder.encoder.layers.8.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.8.mlp.fc1.bias": "vision_encoder.encoder.layers.8.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.8.mlp.fc2.weight": "vision_encoder.encoder.layers.8.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.8.mlp.fc2.bias": "vision_encoder.encoder.layers.8.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.8.layer_norm2.weight": "vision_encoder.encoder.layers.8.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.8.layer_norm2.bias": "vision_encoder.encoder.layers.8.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.9.self_attn.q_proj.weight": "vision_encoder.encoder.layers.9.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.9.self_attn.q_proj.bias": "vision_encoder.encoder.layers.9.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.9.self_attn.k_proj.weight": "vision_encoder.encoder.layers.9.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.9.self_attn.k_proj.bias": "vision_encoder.encoder.layers.9.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.9.self_attn.v_proj.weight": "vision_encoder.encoder.layers.9.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.9.self_attn.v_proj.bias": "vision_encoder.encoder.layers.9.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.9.self_attn.out_proj.weight": "vision_encoder.encoder.layers.9.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.9.self_attn.out_proj.bias": "vision_encoder.encoder.layers.9.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.9.layer_norm1.weight": "vision_encoder.encoder.layers.9.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.9.layer_norm1.bias": "vision_encoder.encoder.layers.9.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.9.mlp.fc1.weight": "vision_encoder.encoder.layers.9.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.9.mlp.fc1.bias": "vision_encoder.encoder.layers.9.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.9.mlp.fc2.weight": "vision_encoder.encoder.layers.9.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.9.mlp.fc2.bias": "vision_encoder.encoder.layers.9.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.9.layer_norm2.weight": "vision_encoder.encoder.layers.9.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.9.layer_norm2.bias": "vision_encoder.encoder.layers.9.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.10.self_attn.q_proj.weight": "vision_encoder.encoder.layers.10.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.10.self_attn.q_proj.bias": "vision_encoder.encoder.layers.10.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.10.self_attn.k_proj.weight": "vision_encoder.encoder.layers.10.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.10.self_attn.k_proj.bias": "vision_encoder.encoder.layers.10.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.10.self_attn.v_proj.weight": "vision_encoder.encoder.layers.10.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.10.self_attn.v_proj.bias": "vision_encoder.encoder.layers.10.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.10.self_attn.out_proj.weight": "vision_encoder.encoder.layers.10.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.10.self_attn.out_proj.bias": "vision_encoder.encoder.layers.10.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.10.layer_norm1.weight": "vision_encoder.encoder.layers.10.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.10.layer_norm1.bias": "vision_encoder.encoder.layers.10.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.10.mlp.fc1.weight": "vision_encoder.encoder.layers.10.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.10.mlp.fc1.bias": "vision_encoder.encoder.layers.10.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.10.mlp.fc2.weight": "vision_encoder.encoder.layers.10.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.10.mlp.fc2.bias": "vision_encoder.encoder.layers.10.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.10.layer_norm2.weight": "vision_encoder.encoder.layers.10.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.10.layer_norm2.bias": "vision_encoder.encoder.layers.10.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.11.self_attn.q_proj.weight": "vision_encoder.encoder.layers.11.self_attn.q_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.11.self_attn.q_proj.bias": "vision_encoder.encoder.layers.11.self_attn.q_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.11.self_attn.k_proj.weight": "vision_encoder.encoder.layers.11.self_attn.k_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.11.self_attn.k_proj.bias": "vision_encoder.encoder.layers.11.self_attn.k_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.11.self_attn.v_proj.weight": "vision_encoder.encoder.layers.11.self_attn.v_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.11.self_attn.v_proj.bias": "vision_encoder.encoder.layers.11.self_attn.v_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.11.self_attn.out_proj.weight": "vision_encoder.encoder.layers.11.self_attn.out_proj.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.11.self_attn.out_proj.bias": "vision_encoder.encoder.layers.11.self_attn.out_proj.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.11.layer_norm1.weight": "vision_encoder.encoder.layers.11.layer_norm1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.11.layer_norm1.bias": "vision_encoder.encoder.layers.11.layer_norm1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.11.mlp.fc1.weight": "vision_encoder.encoder.layers.11.mlp.fc1.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.11.mlp.fc1.bias": "vision_encoder.encoder.layers.11.mlp.fc1.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.11.mlp.fc2.weight": "vision_encoder.encoder.layers.11.mlp.fc2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.11.mlp.fc2.bias": "vision_encoder.encoder.layers.11.mlp.fc2.bias",
      "vlm_with_expert.vision_encoder.encoder.layers.11.layer_norm2.weight": "vision_encoder.encoder.layers.11.layer_norm2.weight",
      "vlm_with_expert.vision_encoder.encoder.layers.11.layer_norm2.bias": "vision_encoder.encoder.layers.11.layer_norm2.bias",
      "vlm_with_expert.vision_encoder.post_layernorm.weight": "vision_encoder.post_layernorm.weight",
      "vlm_with_expert.vision_encoder.post_layernorm.bias": "vision_encoder.post_layernorm.bias",
      "vlm_with_expert.connector.proj.weight": "vision_encoder.connector.proj.weight",
      "vlm_with_expert.text_model.embed_tokens.weight": "text_embedding.weight",
      "vlm_with_expert.text_model.layers.0.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.0.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.0.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.0.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.0.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.0.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.0.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.0.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.0.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.0.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.0.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.0.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.0.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.0.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.0.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.0.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.0.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.0.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.1.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.1.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.1.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.1.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.1.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.1.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.1.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.1.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.1.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.1.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.1.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.1.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.1.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.1.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.1.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.1.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.1.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.1.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.2.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.2.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.2.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.2.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.2.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.2.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.2.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.2.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.2.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.2.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.2.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.2.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.2.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.2.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.2.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.2.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.2.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.2.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.3.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.3.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.3.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.3.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.3.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.3.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.3.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.3.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.3.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.3.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.3.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.3.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.3.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.3.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.3.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.3.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.3.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.3.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.4.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.4.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.4.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.4.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.4.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.4.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.4.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.4.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.4.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.4.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.4.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.4.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.4.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.4.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.4.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.4.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.4.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.4.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.5.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.5.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.5.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.5.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.5.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.5.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.5.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.5.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.5.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.5.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.5.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.5.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.5.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.5.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.5.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.5.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.5.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.5.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.6.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.6.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.6.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.6.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.6.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.6.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.6.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.6.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.6.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.6.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.6.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.6.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.6.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.6.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.6.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.6.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.6.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.6.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.7.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.7.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.7.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.7.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.7.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.7.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.7.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.7.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.7.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.7.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.7.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.7.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.7.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.7.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.7.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.7.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.7.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.7.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.8.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.8.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.8.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.8.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.8.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.8.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.8.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.8.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.8.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.8.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.8.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.8.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.8.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.8.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.8.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.8.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.8.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.8.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.9.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.9.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.9.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.9.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.9.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.9.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.9.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.9.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.9.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.9.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.9.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.9.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.9.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.9.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.9.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.9.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.9.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.9.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.10.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.10.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.10.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.10.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.10.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.10.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.10.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.10.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.10.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.10.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.10.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.10.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.10.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.10.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.10.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.10.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.10.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.10.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.11.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.11.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.11.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.11.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.11.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.11.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.11.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.11.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.11.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.11.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.11.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.11.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.11.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.11.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.11.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.11.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.11.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.11.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.12.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.12.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.12.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.12.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.12.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.12.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.12.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.12.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.12.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.12.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.12.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.12.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.12.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.12.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.12.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.12.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.12.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.12.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.13.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.13.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.13.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.13.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.13.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.13.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.13.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.13.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.13.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.13.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.13.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.13.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.13.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.13.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.13.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.13.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.13.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.13.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.14.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.14.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.14.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.14.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.14.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.14.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.14.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.14.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.14.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.14.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.14.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.14.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.14.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.14.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.14.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.14.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.14.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.14.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.layers.15.self_attn.q_proj.weight": "vlm_expert_transformer.vlm_layers.15.self_attn.q_proj.weight",
      "vlm_with_expert.text_model.layers.15.self_attn.k_proj.weight": "vlm_expert_transformer.vlm_layers.15.self_attn.k_proj.weight",
      "vlm_with_expert.text_model.layers.15.self_attn.v_proj.weight": "vlm_expert_transformer.vlm_layers.15.self_attn.v_proj.weight",
      "vlm_with_expert.text_model.layers.15.self_attn.o_proj.weight": "vlm_expert_transformer.vlm_layers.15.self_attn.o_proj.weight",
      "vlm_with_expert.text_model.layers.15.mlp.gate_proj.weight": "vlm_expert_transformer.vlm_layers.15.mlp.gate_proj.weight",
      "vlm_with_expert.text_model.layers.15.mlp.up_proj.weight": "vlm_expert_transformer.vlm_layers.15.mlp.up_proj.weight",
      "vlm_with_expert.text_model.layers.15.mlp.down_proj.weight": "vlm_expert_transformer.vlm_layers.15.mlp.down_proj.weight",
      "vlm_with_expert.text_model.layers.15.input_layernorm.weight": "vlm_expert_transformer.vlm_layers.15.input_layernorm.weight",
      "vlm_with_expert.text_model.layers.15.post_attention_layernorm.weight": "vlm_expert_transformer.vlm_layers.15.post_attention_layernorm.weight",
      "vlm_with_expert.text_model.norm.weight": "vlm_expert_transformer.vlm_norm.weight",
      "vlm_with_expert.lm_expert.layers.0.self_attn.q_proj.weight": "vlm_expert_transformer.expert_layers.0.self_attn.q_proj.weight",
      "vlm_with_expert.lm_expert.layers.0.self_attn.k_proj.weight": "vlm_expert_transformer.expert_layers.0.self_attn.k_proj.weight",
      "vlm_with_expert.lm_expert.layers.0.self_attn.v_proj.weight": "vlm_expert_transformer.expert_layers.0.self_attn.v_proj.weight",
      "vlm_with_expert.lm_expert.layers.0.self_attn.o_proj.weight": "vlm_expert_transformer.expert_layers.0.self_attn.o_proj.weight",
      "vlm_with_expert.lm_expert.layers.0.mlp.gate_proj.weight": "vlm_expert_transformer.expert_layers.0.mlp.gate_proj.weight",
      "vlm_with_expert.lm_expert.layers.0.mlp.up_proj.weight": "vlm_expert_transformer.expert_layers.0.mlp.up_proj.weight",
      "vlm_with_expert.lm_expert.layers.0.mlp.down_proj.weight": "vlm_expert_transformer.expert_layers.0.mlp.down_proj.weight",
      "vlm_with_expert.lm_expert.layers.0.input_layernorm.weight": "vlm_expert_transformer.expert_layers.0.input_layernorm.weight",
      "vlm_with_expert.lm_expert.layers.0.post_attention_layernorm.weight": "vlm_expert_transformer.expert_layers.0.post_attention_layernorm.weight",
      "vlm_with_expert.lm_expert.layers.1.self_attn.q_proj.weight": "vlm_expert_transformer.expert_layers.1.self_attn.q_proj.weight",
      "vlm_with_expert.lm_expert.layers.1.self_attn.k_proj.weight": "vlm_expert_transformer.expert_layers.1.self_attn.k_proj.weight",
      "vlm_with_expert.lm_expert.layers.1.self_attn.v_proj.weight": "vlm_expert_transformer.expert_layers.1.self_attn.v_proj.weight",
      "vlm_with_expert.lm_expert.layers.1.self_attn.o_proj.weight": "vlm_expert_transformer.expert_layers.1.self_attn.o_proj.weight",
      "vlm_with_expert.lm_expert.layers.1.mlp.gate_proj.weight": "vlm_expert_transformer.expert_layers.1.mlp.gate_proj.weight",
      "vlm_with_expert.lm_expert.layers.1.mlp.up_proj.weight": "vlm_expert_transformer.expert_layers.1.mlp.up_proj.weight",
      "vlm_with_expert.lm_expert.layers.1.mlp.down_proj.weight": "vlm_expert_transformer.expert_layers.1.mlp.down_proj.weight",
      "vlm_with_expert.lm_expert.layers.1.input_layernorm.weight": "vlm_expert_transformer.expert_layers.1.input_layernorm.weight",
      "vlm_with_expert.lm_expert.layers.1.post_attention_layernorm.weight": "vlm_expert_transformer.expert_layers.1.post_attention_layernorm.weight",
      "vlm_with_expert.lm_expert.layers.2.self_attn.q_proj.weight": "vlm_expert_transformer.expert_layers.2.self_attn.q_proj.weight",
      "vlm_with_expert.lm_expert.layers.2.self_attn.k_proj.weight": "vlm_expert_transformer.expert_layers.2.self_attn.k_proj.weight",
      "vlm_with_expert.lm_expert.layers.2.self_attn.v_proj.weight": "vlm_expert_transformer.expert_layers.2.self_attn.v_proj.weight",
      "vlm_with_expert.lm_expert.layers.2.self_attn.o_proj.weight": "vlm_expert_transformer.expert_layers.2.self_attn.o_proj.weight",
      "vlm_with_expert.lm_expert.layers.2.mlp.gate_proj.weight": "vlm_expert_transformer.expert_layers.2.mlp.gate_proj.weight",
      "vlm_with_expert.lm_expert.layers.2.mlp.up_proj.weight": "vlm_expert_transformer.expert_layers.2.mlp.up_proj.weight",
      "vlm_with_expert.lm_expert.layers.2.mlp.down_proj.weight": "vlm_expert_transformer.expert_layers.2.mlp.down_proj.weight",
      "vlm_with_expert.lm_expert.layers.2.input_layernorm.weight": "vlm_expert_transformer.expert_layers.2.input_layernorm.weight",
      "vlm_with_expert.lm_expert.layers.2.post_attention_layernorm.weight": "vlm_expert_transformer.expert_layers.2.post_attention_layernorm.weight",
      "vlm_with_expert.lm_expert.layers.3.self_attn.q_proj.weight": "vlm_expert_transformer.expert_layers.3.self_attn.q_proj.weight",
      "vlm_with_expert.lm_expert.layers.3.self_attn.k_proj.weight": "vlm_expert_transformer.expert_layers.3.self_attn.k_proj.weight",
      "vlm_with_expert.lm_expert.layers.3.self_attn.v_proj.weight": "vlm_expert_transformer.expert_layers.3.self_attn.v_proj.weight",
      "vlm_with_expert.lm_expert.layers.3.self_attn.o_proj.weight": "vlm_expert_transformer.expert_layers.3.self_attn.o_proj.weight",
      "vlm_with_expert.lm_expert.layers.3.mlp.gate_proj.weight": "vlm_expert_transformer.expert_layers.3.mlp.gate_proj.weight",
