{
  "timestamp": "2026-02-27T11:24:04.946662",
  "original_file": "output\\level3\\smolvla\\level_2_layer\\action_time_mlp.py",
  "refactored_file": "output\\level3\\smolvla\\steps\\step_3_action_time_mlp\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "PASS",
    "violations": [],
    "source_violations": [],
    "parameter_violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 6,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "action_in_proj.weight": "action_in_proj.weight",
      "action_in_proj.bias": "action_in_proj.bias",
      "action_time_mlp_in.weight": "silu_linear_mlp.mlp_in.weight",
      "action_time_mlp_in.bias": "silu_linear_mlp.mlp_in.bias",
      "action_time_mlp_out.weight": "silu_linear_mlp.mlp_out.weight",
      "action_time_mlp_out.bias": "silu_linear_mlp.mlp_out.bias"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              50,
              720
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              50,
              720
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              50,
              720
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}