{
  "timestamp": "2026-02-24T14:59:51.862206",
  "original_file": "output\\level3\\11_VGG16\\steps\\step_2_classifier_to_fusions\\original.py",
  "refactored_file": "output\\level3\\11_VGG16\\steps\\step_2_classifier_to_fusions\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "PASS",
    "violations": [],
    "source_violations": [],
    "parameter_violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 6,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "classifier.0.weight": "linear_relu_dropout_1.linear.weight",
      "classifier.0.bias": "linear_relu_dropout_1.linear.bias",
      "classifier.3.weight": "linear_relu_dropout_2.linear.weight",
      "classifier.3.bias": "linear_relu_dropout_2.linear.bias",
      "classifier.6.weight": "final_linear.linear.weight",
      "classifier.6.bias": "final_linear.linear.bias"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              10,
              1000
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              10,
              1000
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              10,
              1000
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}