{
  "timestamp": "2026-02-24T14:52:25.916278",
  "original_file": "data\\kernelbench\\level3\\11_VGG16.py",
  "refactored_file": "output\\level3\\11_VGG16\\steps\\step_1_model_to_layers\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "PASS",
    "violations": [],
    "source_violations": [],
    "parameter_violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 32,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "features.0.weight": "features_block_1.block.0.weight",
      "features.0.bias": "features_block_1.block.0.bias",
      "features.2.weight": "features_block_1.block.2.weight",
      "features.2.bias": "features_block_1.block.2.bias",
      "features.5.weight": "features_block_2.block.0.weight",
      "features.5.bias": "features_block_2.block.0.bias",
      "features.7.weight": "features_block_2.block.2.weight",
      "features.7.bias": "features_block_2.block.2.bias",
      "features.10.weight": "features_block_3.block.0.weight",
      "features.10.bias": "features_block_3.block.0.bias",
      "features.12.weight": "features_block_3.block.2.weight",
      "features.12.bias": "features_block_3.block.2.bias",
      "features.14.weight": "features_block_3.block.4.weight",
      "features.14.bias": "features_block_3.block.4.bias",
      "features.17.weight": "features_block_4.block.0.weight",
      "features.17.bias": "features_block_4.block.0.bias",
      "features.19.weight": "features_block_4.block.2.weight",
      "features.19.bias": "features_block_4.block.2.bias",
      "features.21.weight": "features_block_4.block.4.weight",
      "features.21.bias": "features_block_4.block.4.bias",
      "features.24.weight": "features_block_5.block.0.weight",
      "features.24.bias": "features_block_5.block.0.bias",
      "features.26.weight": "features_block_5.block.2.weight",
      "features.26.bias": "features_block_5.block.2.bias",
      "features.28.weight": "features_block_5.block.4.weight",
      "features.28.bias": "features_block_5.block.4.bias",
      "classifier.0.weight": "classifier.classifier.0.weight",
      "classifier.0.bias": "classifier.classifier.0.bias",
      "classifier.3.weight": "classifier.classifier.3.weight",
      "classifier.3.bias": "classifier.classifier.3.bias",
      "classifier.6.weight": "classifier.classifier.6.weight",
      "classifier.6.bias": "classifier.classifier.6.bias"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              10,
              1000
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              10,
              1000
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              10,
              1000
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}