{
  "timestamp": "2026-02-27T11:26:22.008838",
  "original_file": "output\\level3\\smolvla\\level_2_layer\\vision_encoder.py",
  "refactored_file": "output\\level3\\smolvla\\steps\\step_2_vision_encoder\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "PASS",
    "violations": [],
    "source_violations": [],
    "parameter_violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 198,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "embeddings.patch_embedding.weight": "embeddings.patch_embedding.weight",
      "embeddings.patch_embedding.bias": "embeddings.patch_embedding.bias",
      "embeddings.position_embedding.weight": "embeddings.position_embedding.weight",
      "encoder.layers.0.self_attn.q_proj.weight": "attention_layers.0.q_proj.weight",
      "encoder.layers.0.self_attn.q_proj.bias": "attention_layers.0.q_proj.bias",
      "encoder.layers.0.self_attn.k_proj.weight": "attention_layers.0.k_proj.weight",
      "encoder.layers.0.self_attn.k_proj.bias": "attention_layers.0.k_proj.bias",
      "encoder.layers.0.self_attn.v_proj.weight": "attention_layers.0.v_proj.weight",
      "encoder.layers.0.self_attn.v_proj.bias": "attention_layers.0.v_proj.bias",
      "encoder.layers.0.self_attn.out_proj.weight": "attention_layers.0.out_proj.weight",
      "encoder.layers.0.self_attn.out_proj.bias": "attention_layers.0.out_proj.bias",
      "encoder.layers.0.layer_norm1.weight": "layer_norms_1.0.norm.weight",
      "encoder.layers.0.layer_norm1.bias": "layer_norms_1.0.norm.bias",
      "encoder.layers.0.mlp.fc1.weight": "mlp_layers.0.fc1.weight",
      "encoder.layers.0.mlp.fc1.bias": "mlp_layers.0.fc1.bias",
      "encoder.layers.0.mlp.fc2.weight": "mlp_layers.0.fc2.weight",
      "encoder.layers.0.mlp.fc2.bias": "mlp_layers.0.fc2.bias",
      "encoder.layers.0.layer_norm2.weight": "layer_norms_2.0.norm.weight",
      "encoder.layers.0.layer_norm2.bias": "layer_norms_2.0.norm.bias",
      "encoder.layers.1.self_attn.q_proj.weight": "attention_layers.1.q_proj.weight",
      "encoder.layers.1.self_attn.q_proj.bias": "attention_layers.1.q_proj.bias",
      "encoder.layers.1.self_attn.k_proj.weight": "attention_layers.1.k_proj.weight",
      "encoder.layers.1.self_attn.k_proj.bias": "attention_layers.1.k_proj.bias",
      "encoder.layers.1.self_attn.v_proj.weight": "attention_layers.1.v_proj.weight",
      "encoder.layers.1.self_attn.v_proj.bias": "attention_layers.1.v_proj.bias",
      "encoder.layers.1.self_attn.out_proj.weight": "attention_layers.1.out_proj.weight",
      "encoder.layers.1.self_attn.out_proj.bias": "attention_layers.1.out_proj.bias",
      "encoder.layers.1.layer_norm1.weight": "layer_norms_1.1.norm.weight",
      "encoder.layers.1.layer_norm1.bias": "layer_norms_1.1.norm.bias",
      "encoder.layers.1.mlp.fc1.weight": "mlp_layers.1.fc1.weight",
      "encoder.layers.1.mlp.fc1.bias": "mlp_layers.1.fc1.bias",
      "encoder.layers.1.mlp.fc2.weight": "mlp_layers.1.fc2.weight",
      "encoder.layers.1.mlp.fc2.bias": "mlp_layers.1.fc2.bias",
      "encoder.layers.1.layer_norm2.weight": "layer_norms_2.1.norm.weight",
      "encoder.layers.1.layer_norm2.bias": "layer_norms_2.1.norm.bias",
      "encoder.layers.2.self_attn.q_proj.weight": "attention_layers.2.q_proj.weight",
      "encoder.layers.2.self_attn.q_proj.bias": "attention_layers.2.q_proj.bias",
      "encoder.layers.2.self_attn.k_proj.weight": "attention_layers.2.k_proj.weight",
      "encoder.layers.2.self_attn.k_proj.bias": "attention_layers.2.k_proj.bias",
      "encoder.layers.2.self_attn.v_proj.weight": "attention_layers.2.v_proj.weight",
      "encoder.layers.2.self_attn.v_proj.bias": "attention_layers.2.v_proj.bias",
      "encoder.layers.2.self_attn.out_proj.weight": "attention_layers.2.out_proj.weight",
      "encoder.layers.2.self_attn.out_proj.bias": "attention_layers.2.out_proj.bias",
      "encoder.layers.2.layer_norm1.weight": "layer_norms_1.2.norm.weight",
      "encoder.layers.2.layer_norm1.bias": "layer_norms_1.2.norm.bias",
      "encoder.layers.2.mlp.fc1.weight": "mlp_layers.2.fc1.weight",
      "encoder.layers.2.mlp.fc1.bias": "mlp_layers.2.fc1.bias",
      "encoder.layers.2.mlp.fc2.weight": "mlp_layers.2.fc2.weight",
      "encoder.layers.2.mlp.fc2.bias": "mlp_layers.2.fc2.bias",
      "encoder.layers.2.layer_norm2.weight": "layer_norms_2.2.norm.weight",
      "encoder.layers.2.layer_norm2.bias": "layer_norms_2.2.norm.bias",
      "encoder.layers.3.self_attn.q_proj.weight": "attention_layers.3.q_proj.weight",
      "encoder.layers.3.self_attn.q_proj.bias": "attention_layers.3.q_proj.bias",
      "encoder.layers.3.self_attn.k_proj.weight": "attention_layers.3.k_proj.weight",
      "encoder.layers.3.self_attn.k_proj.bias": "attention_layers.3.k_proj.bias",
      "encoder.layers.3.self_attn.v_proj.weight": "attention_layers.3.v_proj.weight",
      "encoder.layers.3.self_attn.v_proj.bias": "attention_layers.3.v_proj.bias",
      "encoder.layers.3.self_attn.out_proj.weight": "attention_layers.3.out_proj.weight",
      "encoder.layers.3.self_attn.out_proj.bias": "attention_layers.3.out_proj.bias",
      "encoder.layers.3.layer_norm1.weight": "layer_norms_1.3.norm.weight",
      "encoder.layers.3.layer_norm1.bias": "layer_norms_1.3.norm.bias",
      "encoder.layers.3.mlp.fc1.weight": "mlp_layers.3.fc1.weight",
      "encoder.layers.3.mlp.fc1.bias": "mlp_layers.3.fc1.bias",
      "encoder.layers.3.mlp.fc2.weight": "mlp_layers.3.fc2.weight",
      "encoder.layers.3.mlp.fc2.bias": "mlp_layers.3.fc2.bias",
      "encoder.layers.3.layer_norm2.weight": "layer_norms_2.3.norm.weight",
      "encoder.layers.3.layer_norm2.bias": "layer_norms_2.3.norm.bias",
      "encoder.layers.4.self_attn.q_proj.weight": "attention_layers.4.q_proj.weight",
      "encoder.layers.4.self_attn.q_proj.bias": "attention_layers.4.q_proj.bias",
      "encoder.layers.4.self_attn.k_proj.weight": "attention_layers.4.k_proj.weight",
      "encoder.layers.4.self_attn.k_proj.bias": "attention_layers.4.k_proj.bias",
      "encoder.layers.4.self_attn.v_proj.weight": "attention_layers.4.v_proj.weight",
      "encoder.layers.4.self_attn.v_proj.bias": "attention_layers.4.v_proj.bias",
      "encoder.layers.4.self_attn.out_proj.weight": "attention_layers.4.out_proj.weight",
      "encoder.layers.4.self_attn.out_proj.bias": "attention_layers.4.out_proj.bias",
      "encoder.layers.4.layer_norm1.weight": "layer_norms_1.4.norm.weight",
      "encoder.layers.4.layer_norm1.bias": "layer_norms_1.4.norm.bias",
      "encoder.layers.4.mlp.fc1.weight": "mlp_layers.4.fc1.weight",
      "encoder.layers.4.mlp.fc1.bias": "mlp_layers.4.fc1.bias",
      "encoder.layers.4.mlp.fc2.weight": "mlp_layers.4.fc2.weight",
      "encoder.layers.4.mlp.fc2.bias": "mlp_layers.4.fc2.bias",
      "encoder.layers.4.layer_norm2.weight": "layer_norms_2.4.norm.weight",
      "encoder.layers.4.layer_norm2.bias": "layer_norms_2.4.norm.bias",
      "encoder.layers.5.self_attn.q_proj.weight": "attention_layers.5.q_proj.weight",
      "encoder.layers.5.self_attn.q_proj.bias": "attention_layers.5.q_proj.bias",
      "encoder.layers.5.self_attn.k_proj.weight": "attention_layers.5.k_proj.weight",
      "encoder.layers.5.self_attn.k_proj.bias": "attention_layers.5.k_proj.bias",
      "encoder.layers.5.self_attn.v_proj.weight": "attention_layers.5.v_proj.weight",
      "encoder.layers.5.self_attn.v_proj.bias": "attention_layers.5.v_proj.bias",
      "encoder.layers.5.self_attn.out_proj.weight": "attention_layers.5.out_proj.weight",
      "encoder.layers.5.self_attn.out_proj.bias": "attention_layers.5.out_proj.bias",
      "encoder.layers.5.layer_norm1.weight": "layer_norms_1.5.norm.weight",
      "encoder.layers.5.layer_norm1.bias": "layer_norms_1.5.norm.bias",
      "encoder.layers.5.mlp.fc1.weight": "mlp_layers.5.fc1.weight",
      "encoder.layers.5.mlp.fc1.bias": "mlp_layers.5.fc1.bias",
      "encoder.layers.5.mlp.fc2.weight": "mlp_layers.5.fc2.weight",
      "encoder.layers.5.mlp.fc2.bias": "mlp_layers.5.fc2.bias",
      "encoder.layers.5.layer_norm2.weight": "layer_norms_2.5.norm.weight",
      "encoder.layers.5.layer_norm2.bias": "layer_norms_2.5.norm.bias",
      "encoder.layers.6.self_attn.q_proj.weight": "attention_layers.6.q_proj.weight",
      "encoder.layers.6.self_attn.q_proj.bias": "attention_layers.6.q_proj.bias",
      "encoder.layers.6.self_attn.k_proj.weight": "attention_layers.6.k_proj.weight",
      "encoder.layers.6.self_attn.k_proj.bias": "attention_layers.6.k_proj.bias",
      "encoder.layers.6.self_attn.v_proj.weight": "attention_layers.6.v_proj.weight",
      "encoder.layers.6.self_attn.v_proj.bias": "attention_layers.6.v_proj.bias",
      "encoder.layers.6.self_attn.out_proj.weight": "attention_layers.6.out_proj.weight",
      "encoder.layers.6.self_attn.out_proj.bias": "attention_layers.6.out_proj.bias",
      "encoder.layers.6.layer_norm1.weight": "layer_norms_1.6.norm.weight",
      "encoder.layers.6.layer_norm1.bias": "layer_norms_1.6.norm.bias",
      "encoder.layers.6.mlp.fc1.weight": "mlp_layers.6.fc1.weight",
      "encoder.layers.6.mlp.fc1.bias": "mlp_layers.6.fc1.bias",
      "encoder.layers.6.mlp.fc2.weight": "mlp_layers.6.fc2.weight",
      "encoder.layers.6.mlp.fc2.bias": "mlp_layers.6.fc2.bias",
      "encoder.layers.6.layer_norm2.weight": "layer_norms_2.6.norm.weight",
      "encoder.layers.6.layer_norm2.bias": "layer_norms_2.6.norm.bias",
      "encoder.layers.7.self_attn.q_proj.weight": "attention_layers.7.q_proj.weight",
      "encoder.layers.7.self_attn.q_proj.bias": "attention_layers.7.q_proj.bias",
      "encoder.layers.7.self_attn.k_proj.weight": "attention_layers.7.k_proj.weight",
      "encoder.layers.7.self_attn.k_proj.bias": "attention_layers.7.k_proj.bias",
      "encoder.layers.7.self_attn.v_proj.weight": "attention_layers.7.v_proj.weight",
      "encoder.layers.7.self_attn.v_proj.bias": "attention_layers.7.v_proj.bias",
      "encoder.layers.7.self_attn.out_proj.weight": "attention_layers.7.out_proj.weight",
      "encoder.layers.7.self_attn.out_proj.bias": "attention_layers.7.out_proj.bias",
      "encoder.layers.7.layer_norm1.weight": "layer_norms_1.7.norm.weight",
      "encoder.layers.7.layer_norm1.bias": "layer_norms_1.7.norm.bias",
      "encoder.layers.7.mlp.fc1.weight": "mlp_layers.7.fc1.weight",
      "encoder.layers.7.mlp.fc1.bias": "mlp_layers.7.fc1.bias",
      "encoder.layers.7.mlp.fc2.weight": "mlp_layers.7.fc2.weight",
      "encoder.layers.7.mlp.fc2.bias": "mlp_layers.7.fc2.bias",
      "encoder.layers.7.layer_norm2.weight": "layer_norms_2.7.norm.weight",
      "encoder.layers.7.layer_norm2.bias": "layer_norms_2.7.norm.bias",
      "encoder.layers.8.self_attn.q_proj.weight": "attention_layers.8.q_proj.weight",
      "encoder.layers.8.self_attn.q_proj.bias": "attention_layers.8.q_proj.bias",
      "encoder.layers.8.self_attn.k_proj.weight": "attention_layers.8.k_proj.weight",
      "encoder.layers.8.self_attn.k_proj.bias": "attention_layers.8.k_proj.bias",
      "encoder.layers.8.self_attn.v_proj.weight": "attention_layers.8.v_proj.weight",
      "encoder.layers.8.self_attn.v_proj.bias": "attention_layers.8.v_proj.bias",
      "encoder.layers.8.self_attn.out_proj.weight": "attention_layers.8.out_proj.weight",
      "encoder.layers.8.self_attn.out_proj.bias": "attention_layers.8.out_proj.bias",
      "encoder.layers.8.layer_norm1.weight": "layer_norms_1.8.norm.weight",
      "encoder.layers.8.layer_norm1.bias": "layer_norms_1.8.norm.bias",
      "encoder.layers.8.mlp.fc1.weight": "mlp_layers.8.fc1.weight",
      "encoder.layers.8.mlp.fc1.bias": "mlp_layers.8.fc1.bias",
      "encoder.layers.8.mlp.fc2.weight": "mlp_layers.8.fc2.weight",
      "encoder.layers.8.mlp.fc2.bias": "mlp_layers.8.fc2.bias",
      "encoder.layers.8.layer_norm2.weight": "layer_norms_2.8.norm.weight",
      "encoder.layers.8.layer_norm2.bias": "layer_norms_2.8.norm.bias",
      "encoder.layers.9.self_attn.q_proj.weight": "attention_layers.9.q_proj.weight",
      "encoder.layers.9.self_attn.q_proj.bias": "attention_layers.9.q_proj.bias",
      "encoder.layers.9.self_attn.k_proj.weight": "attention_layers.9.k_proj.weight",
      "encoder.layers.9.self_attn.k_proj.bias": "attention_layers.9.k_proj.bias",
      "encoder.layers.9.self_attn.v_proj.weight": "attention_layers.9.v_proj.weight",
      "encoder.layers.9.self_attn.v_proj.bias": "attention_layers.9.v_proj.bias",
      "encoder.layers.9.self_attn.out_proj.weight": "attention_layers.9.out_proj.weight",
      "encoder.layers.9.self_attn.out_proj.bias": "attention_layers.9.out_proj.bias",
      "encoder.layers.9.layer_norm1.weight": "layer_norms_1.9.norm.weight",
      "encoder.layers.9.layer_norm1.bias": "layer_norms_1.9.norm.bias",
      "encoder.layers.9.mlp.fc1.weight": "mlp_layers.9.fc1.weight",
      "encoder.layers.9.mlp.fc1.bias": "mlp_layers.9.fc1.bias",
      "encoder.layers.9.mlp.fc2.weight": "mlp_layers.9.fc2.weight",
      "encoder.layers.9.mlp.fc2.bias": "mlp_layers.9.fc2.bias",
      "encoder.layers.9.layer_norm2.weight": "layer_norms_2.9.norm.weight",
      "encoder.layers.9.layer_norm2.bias": "layer_norms_2.9.norm.bias",
      "encoder.layers.10.self_attn.q_proj.weight": "attention_layers.10.q_proj.weight",
      "encoder.layers.10.self_attn.q_proj.bias": "attention_layers.10.q_proj.bias",
      "encoder.layers.10.self_attn.k_proj.weight": "attention_layers.10.k_proj.weight",
      "encoder.layers.10.self_attn.k_proj.bias": "attention_layers.10.k_proj.bias",
      "encoder.layers.10.self_attn.v_proj.weight": "attention_layers.10.v_proj.weight",
      "encoder.layers.10.self_attn.v_proj.bias": "attention_layers.10.v_proj.bias",
      "encoder.layers.10.self_attn.out_proj.weight": "attention_layers.10.out_proj.weight",
      "encoder.layers.10.self_attn.out_proj.bias": "attention_layers.10.out_proj.bias",
      "encoder.layers.10.layer_norm1.weight": "layer_norms_1.10.norm.weight",
      "encoder.layers.10.layer_norm1.bias": "layer_norms_1.10.norm.bias",
      "encoder.layers.10.mlp.fc1.weight": "mlp_layers.10.fc1.weight",
      "encoder.layers.10.mlp.fc1.bias": "mlp_layers.10.fc1.bias",
      "encoder.layers.10.mlp.fc2.weight": "mlp_layers.10.fc2.weight",
      "encoder.layers.10.mlp.fc2.bias": "mlp_layers.10.fc2.bias",
      "encoder.layers.10.layer_norm2.weight": "layer_norms_2.10.norm.weight",
      "encoder.layers.10.layer_norm2.bias": "layer_norms_2.10.norm.bias",
      "encoder.layers.11.self_attn.q_proj.weight": "attention_layers.11.q_proj.weight",
      "encoder.layers.11.self_attn.q_proj.bias": "attention_layers.11.q_proj.bias",
      "encoder.layers.11.self_attn.k_proj.weight": "attention_layers.11.k_proj.weight",
      "encoder.layers.11.self_attn.k_proj.bias": "attention_layers.11.k_proj.bias",
      "encoder.layers.11.self_attn.v_proj.weight": "attention_layers.11.v_proj.weight",
      "encoder.layers.11.self_attn.v_proj.bias": "attention_layers.11.v_proj.bias",
      "encoder.layers.11.self_attn.out_proj.weight": "attention_layers.11.out_proj.weight",
      "encoder.layers.11.self_attn.out_proj.bias": "attention_layers.11.out_proj.bias",
      "encoder.layers.11.layer_norm1.weight": "layer_norms_1.11.norm.weight",
      "encoder.layers.11.layer_norm1.bias": "layer_norms_1.11.norm.bias",
      "encoder.layers.11.mlp.fc1.weight": "mlp_layers.11.fc1.weight",
      "encoder.layers.11.mlp.fc1.bias": "mlp_layers.11.fc1.bias",
      "encoder.layers.11.mlp.fc2.weight": "mlp_layers.11.fc2.weight",
      "encoder.layers.11.mlp.fc2.bias": "mlp_layers.11.fc2.bias",
      "encoder.layers.11.layer_norm2.weight": "layer_norms_2.11.norm.weight",
      "encoder.layers.11.layer_norm2.bias": "layer_norms_2.11.norm.bias",
      "post_layernorm.weight": "post_layernorm.norm.weight",
      "post_layernorm.bias": "post_layernorm.norm.bias",
      "connector.proj.weight": "connector.proj.weight"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              64,
              960
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              64,
              960
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              64,
              960
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}