{
  "timestamp": "2026-02-27T11:47:13.721441",
  "original_file": "output\\level3\\smolvla\\level_1_fusion\\vision_gelu_mlp.py",
  "refactored_file": "output\\level3\\smolvla\\steps\\step_7_vision_gelu_mlp\\refactored.py",
  "status": "PASS",
  "anticheat": {
    "status": "SKIPPED",
    "violations": []
  },
  "weight_transfer": {
    "status": "OK",
    "mapped_count": 4,
    "unmapped_original": [],
    "unmapped_refactored": [],
    "weight_map": {
      "fc1.weight": "fc1.linear.weight",
      "fc1.bias": "fc1.linear.bias",
      "fc2.weight": "fc2.linear.weight",
      "fc2.bias": "fc2.linear.bias"
    }
  },
  "numerical_comparison": {
    "status": "PASS",
    "rtol": 1e-05,
    "atol": 1e-06,
    "input_dtype": "torch.float32",
    "num_trials": 3,
    "max_diff_across_trials": 0.0,
    "trials": [
      {
        "trial": 0,
        "seed": 42,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              1024,
              768
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 1,
        "seed": 43,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              1024,
              768
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      },
      {
        "trial": 2,
        "seed": 44,
        "max_diff": 0.0,
        "pass": true,
        "output_details": [
          {
            "output_idx": 0,
            "shape_match": true,
            "shape": [
              1,
              1024,
              768
            ],
            "dtype": "torch.float32",
            "max_diff": 0.0,
            "mean_diff": 0.0,
            "matches": true
          }
        ]
      }
    ]
  }
}